app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 3]]
---
	def show
		@articles = Article.find(params[:id])

INSERT INTO "articles" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "gfdsa"], ["created_at", "2014-12-10 10:28:48.856259"], ["title", "wert"], ["updated_at", "2014-12-10 10:28:48.856259"]]
---
	def create
		@articles = Article.new(article_params)
		@articles.save

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 10]]
---
	def edit
		@articles = Article.find(params[:id])

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = 3  [["body", "Maybe you think that I'm stupid? Yes, probably you're right. I'm trying all my best but still programming for me is ghastly difficult.sdf"], ["updated_at", "2014-12-10 13:41:24.331557"]]
---
	def update
		@articles = Article.find(params[:id])
		@articles.update(article_params)

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 8]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 8]]
---
	def destroy
		@articles = Article.find(params[:id])
		@articles.destroy